const bot = require("./bot")

const MAP = [
    ["发薪日", "经过或停留可获取薪水"],
    ["职业出口", ""],
    ["所有人付所得税", ""],
    ["机会", ""],
    ["农业入口", "付500$或已有农业经验"],
    ["职业出口", ""],
    ["购买彩票", "每人选择是否购买"],
    ["大学进修", "付500$"],

    ["医院", ""],
    ["所有人付娱乐税", ""],
    ["大学出口", ""],
    ["企业入口", "付5000$雇佣员工或已有普通学位或已有企业经验"],
    ["企业出口", ""],
    ["画廊", "每人选择是否付3000$获得⭐🧡"],
    ["航海入口", ""],
    ["机会", ""],

    ["日月潭度假", "停留+2🧡"],
    ["航海出口", ""],
    ["汽车展销会", "请选择1.-2000$+5⭐\n2.-2⭐"],
    ["公益入口", "付2000$或已有法律学位或已有公益经验"],
    ["公益出口", ""],
    ["商场", "每人-🎲x300$"],
    ["电影入口", "付1000$设计造型或已有电影经验"],
    ["机会", ""],

    ["公园板凳", "偶数离开"],
    ["电影出口", ""],
    ["股票市场", "每人选择是否付2000$获得🎲x1000$"],
    ["采矿入口", "付5000$购买设备或已有工程学位或已有采矿经验"],
    ["采矿出口", ""],
    ["许愿井", "每人选择是否失去\n1.-5🧡 2.-5⭐ 3.-5000$\n获得\n1.+4🧡 2.+4⭐ 3.+4000$"],
    ["太空探险入口", "付5000$或已有科学学位或已有太空经验"],
    ["获诺贝尔奖", ""],

    //农业
    ["土地肥沃适合耕种", "+2🧡"],
    ["研发新种改良作物", "经验卡"],
    ["发展环保农业", "+5🧡"],
    ["夏季收成", "+🎲x1000$"],
    ["有机饲料家畜健康", "+2⭐+4🧡"],
    ["发生家畜传染病", "-3000$"],
    ["秋季大丰收", "+5000$"],
    ["大雪导致家畜冻死", "-🧡/2"],
    ["成立生物技术实验室", "薪水+1000$"],
    ["结束", ""],
    //大学
    ["结识同学", "+4🧡"],
    ["期中考睡过头", "暂停一次"],
    ["代表学校参加比赛", "+2⭐"],
    ["交错报告", "-🎲x🧡"],
    ["成绩优秀获奖学金", "+1000$"],
    ["当选学生会长", "+6⭐"],
    ["毕业旅行", "经验卡"],
    ["结束", ""],
    //企业
    ["通过实习", "经验卡"],
    ["简历优异", "+4🧡"],
    ["全勤奖金", "+3000$"],
    ["误会客户失去合约", "暂停一次"],
    ["研发新品备受瞩目", "+6⭐"],
    ["成功推广", "+8000$"],
    ["投资", "+4000$"],
    ["表现突出担任经理", "+2⭐+4🧡"],
    ["金融风暴失业", "传送到公园板凳"],
    ["品质不周客户退货", "-$/2"],
    ["年终奖金", "+6000$"],
]

class Player {
    constructor(id, name) {
        this.id = id;
        this.name = name;
        this.position = 0;
        this.exp = {};
        this.salary = 1000;
        this.money = 0;
        this.honor = 0;
        this.amuse = 0;
    }
}

function random() {
    return Math.floor(Math.random() * 6 + 1);
}

class Game {
    constructor(groud_id) {
        this.group_id = groud_id;
        this.players = [];
        this.gameloop = false;
        this.send = function (message) {
            bot.SendGroupMessage(this.group_id, message);
        }
    }
    *update(message) {
        while (this.players.length < 4) {
            yield;
            if (message == ".join") {
                var name = message.sender.card || message.sender.nickname;
                this.players.push(new Player(message.user_id, name))
                this.send(`${name}已加入游戏，当前人数${this.players.length}`);
            }
        }
        this.gameloop = true;
        while (this.gameloop) {
            for (var i = 0; i < 4; i++) {
                var steps = random();
                for (var j = 0; i < steps; j++) {

                }
            }
        }
    }
}
